[
    {
        "name": "Star Generator",
        "url": "stargenerator",
        "github": "https://github.com/Joey-Pekar/star-generator",
        "link": "https://star-generator.glitch.me/",
        "video": "",
        "description": [
            {
                "id": "1",
                "text": "Star Generator was a project that I originally made just using HTML, CSS and JavaScript back when I was in High School. It was a project I had decided to make on night, and I ended up enjoying it. Utilizing the HTML Canvas Element, the program allows for the randomized creation of a star map, complete with a customizable size feature."
            },
            {
                "id": "2",
                "text": "Recently, I have revived the project as a way for me to venture into learning React, as it was something I was interested in. My first project idea to do in React was to create a faithful recreation of that original website. As such, I didn't feel a need to modify it in any extreme way."
            },
            {
                "id": "3",
                "text": "The website is currently hosted online using the free website Glitch.com, which allows for free publishing of web applications dependent on Node.JS. The website can be reached by clicking on the website link in the header of this page or by following the link here: https://star-generator.glitch.me/"
            }
        ],
        "images": [
            {
                "id": "1",
                "dir": "https://raw.githubusercontent.com/Joey-Pekar/Portfolio/master/img/star-gen/Example.png",
                "alt": "Image of output",
                "text": "Example output for Star Generator"
            }
        ]
    },
    {
        "name": "Portfolio",
        "url": "portfolio",
        "github": "https://github.com/Joey-Pekar/Portfolio",
        "link": "",
        "video": "",
        "description": [
            {
                "id": "1",
                "text": "This website is added because while it just serves to showcase my other projects, it was a project of itself. Developed using React and React-Bootstrap, this portfolio site was developed to be easily extendable. Through the use of a simple JSON file, projects can be easily added, including images and Github access."
            },
            {
                "id": "2",
                "text": "Using React Router, it can determine what components to display based on the current url of page. Components of specific pages are generated automatically from the JSON file specified. The only pages that are automatically included within the website is the Home and Contact pages."
            },
            {
                "id": "3",
                "text": "Additional tools used for the development of this website were Font Awesome, Google Fonts, and Webpack, the latter of which was used to compile SASS and JSX files for use on the site."
            }
        ],
        "images": []
    },
    {
        "name": "Scorekeeper",
        "url": "scorekeeper",
        "github": "https://github.com/Joey-Pekar/Scorekeeper",
        "link": "",
        "video": "",
        "description": [
            {
                "id": "1",
                "text": "Scorekeeper is a Java library used for creating, storing and pulling user scores from a MySQL database. It utilizes Reflection to take a class as an argument, and take the fields in that class and turn them into columns in a table."
            },
            {
                "id": "2",
                "text": "Scorekeeper was developed in IntelliJ, using Maven to get dependencies. Dependencies include MySQL Connector Java and JUnit for database access and testing respectively."
            },
            {
                "id": "3",
                "text": "In addition, a simple demo application was developed using Java and JavaFX to demonstrate it's functionality. The demo does require a MySQL database to be provided."
            }
        ],
        "images": [
            {
                "id": "1",
                "dir": "https://raw.githubusercontent.com/Joey-Pekar/Portfolio/master/img/scorekeeper/image1.png",
                "alt": "Image of demo",
                "text": "Scorekeeper Demo Startup"
            },
            {
                "id": "2",
                "dir": "https://raw.githubusercontent.com/Joey-Pekar/Portfolio/master/img/scorekeeper/image2.png",
                "alt": "Image of demo",
                "text": "Scorekeeper Demo Usage"
            },
            {
                "id": "3",
                "dir": "https://raw.githubusercontent.com/Joey-Pekar/Portfolio/master/img/scorekeeper/image3.png",
                "alt": "Database Table Showcase",
                "text": "Database Table Showcase"
            }
        ]
    },
    {
        "name": "Opponents",
        "url": "opponents",
        "github": "https://github.com/Joey-Pekar/Opponents",
        "link": "https://joey-pekar.github.io/OpponentsApp/",
        "video": "",
        "description": [
            {
                "id": "1",
                "text": "Opponents is a web site developed using React. It is a Stat-Block generator for the Genesys and FFG Star Wars Tabletop Role-Playing Games."
            },
            {
                "id": "2",
                "text": "This provides all the tools to make an enemy statblock within both systems, including input for every skill. Upon completion, the statblock can then be converted to a PDF file and downloaded."
            },
            {
                "id": "3",
                "text": "Tools used for this include React-PDF for generating the PDF, React-Bootstrap for Bootstrap formatting, SASS for CSS Stylesheets and Webpack to bundle the files."
            }
        ],
        "images": [

        ]
    }
]